title_text = """
# Red Party
Red Party是一个解密游戏的demo，你需要和游戏元素交互，获取信息，并给出答案。

和`椅子`对话，坐上它，说出你的答案。你将对整个故事进行推演，并确认答案是否正确。
"""

img_title = "示意图"

mission_text = """
亲爱的先生，我是威尔逊，我遇到了一点问题，需要您的帮助。
这是一八九○年四月二十七日的《纪事年报》，正好是两个月以前的。里面的内容是'红发会：由于原住美国宾夕法尼亚洲已故黎巴嫩人伊齐基亚·霍普金斯之遗赠，现留有另一空职，凡红发会会员皆有资格申请。薪给为每周四英镑，工作则实系挂名而已。凡红发男性，年满二十一岁，身体健康，智力健全者即属符合条件。应聘者请于星期一上午十一时亲至舰队街、教皇院７号红发会办公室邓肯·罗斯处提出申请为荷。'
我在市区附近的萨克斯—科伯格广场开了个小当票。那个买卖不大，近年来我只勉强靠它维持生活。过去还有能力雇用两个伙计，但是，现在只雇一个。就这一伙计我也雇不起啊，如果不是他为学会做这个买卖自愿只拿一半工资的话。
正好在八个星期以前的这天，斯波尔丁走到办公室里来，手里拿着这张报纸。他说：
“'威尔逊先生，我向上帝祷告，我多么希望我是个红头发的人啊。'
“我问他，‘那是为什么？'
“他说，‘为什么？红发会现在又有了个空缺。谁要是得到这个职位，那简直是发了相当大的财。据我了解，空缺比谋职的人还多，受托管理那笔资金的理事们简直不知道该怎么办才好，有钱没有地方花啊。奴果我的头发能变颜色就好了，这个怪不错的安乐窝就等着我去了。'
“我问他，'那又是怎么回事呢？
“斯波尔丁两只眼睛瞪得大大地反问我说，‘你从来没有听过红发会的事吗？'
“'从来没有听说过。'
“'你这么说倒使我感到莫名片妙了，因为你自己就有资格去申请那个空着的职位。
“'一年只给二百英镑，但这个工作很轻松，如果你已有别的职务也并不碍事。'
“于是我对他说，‘你把事情的全部情况都告诉我吧。'
“他边把广告指给我看边说，‘好，你自己看吧，红发会有个空缺，这广告上有地址，到那里可以办理申请手续。据我了解，红发会的发起人是一个名叫伊齐基亚·霍普金斯的美国百万富翁。这个人作风很古怪。他自己的头发就是红的，并且对所有红头发的人怀有深厚的感情。他死后大家才知道，原来他把他的巨大的财产留交给财产受托管理人处理，他留下遗嘱要用他的遗产的利息让红头发的男子有个舒适的差事。从我所听到的来说，待遇很高，要干的活倒很少。'
“我说，‘可是，会有数以百万计红头发的男子去申请的。'
“他回答说，‘没有你所想的那么多。你想想看，那实际上只限于伦敦人，而且必须是成年男子。这个美国人青年时代是在伦敦发迹的，他想为这个古老的城市做点好事。而且我还听说，如果你的头发是浅红色或深红色，而不是真正发亮的火红色，那你去申请也是白搭。好啦，威尔逊先生，如果你想申请的话，那你就走进去好了。但是，为了几百英镑的钱，让你受到麻烦，也许是不值得的。'
我的头发，真是鲜红鲜红的。因此，在我看来，如果为了得到这个职位需要竞争一下的话，那么我要比任何同我竞争的人更有希望。文森特·斯波尔丁似乎对这桩事已很了解，所以我想他也许能助我一臂之力。于是，我就叫他把百叶窗关上，马上跟我一起走。他非常高兴得到一个休假日，我们就这样停了业，向广告上登的那个地址出发。
“头发颜色深浅不一的人来自东西南北、四面八方，涌到城里按那个广告去应征。舰队街挤满了红头发的人群，主教院看上去就象叫卖水果的小贩放满广柑的手推车。我没有想到区区一个广告竟然召集到了全国的那么多人。他们头发的颜色什么都有——稻草黄色、柠檬色、橙色、砖红色、爱尔兰长毛猎狗那种颜色、肝色、土黄色等等。但是，正如斯波尔丁所说的那样，真正很鲜艳的火红色的倒不多。当我看到那么多的人在等着，我感到很失望，真想放弃算了。只是，斯波尔丁当时怎么也不答应。我真不能想象他当时是怎样连推带搡，带我从人群中挤过去，直到那办公室的台阶前面。楼梯上有两股人潮，一些人满怀希望往上走，一些人垂头丧气往下走；我们竭尽全力挤进人群。不久，我们发现自己已经在办公室里了。”
“办公室里除了几把木椅和一张办公桌外，没有别的东西。办公桌后面坐着一个头发颜色比我的还要红的小个子男人；每一个候选人走到他跟前，他都说几句，然后他总是想办法在他们身上挑毛病，说他们不合格。原来，要得到一个职位并不是那么容易的事情。不管怎么样，轮到我们的时候，这个小个子男人对我比对任何其他人都客气多了。我们走进去后，他就把门关上，这样他可以和我们单独谈。
“我的伙计说，‘这位是杰贝兹·威尔逊先生，他愿意填补红发会的空缺。'
“对方回答说，‘他非常适合担任这个职务。他满足了我们的一切条件。在我的记忆中，我还没有看见过有谁的头发颜色比他的更好的了。'他后退了一步，歪着脑袋，凝视着我的头发，直看得我不好意思起来。随即他一个箭步向前拉住我的手，热烈祝贺我求职成功。
“他说，‘如果再犹豫不决那就太不对了。不过，对不起，我显然必须谨慎小心，我相信你是不会介意的。'他两只手紧紧地揪住我的头发，使劲地拔，我痛得喊了出来，他才撒手。他撒手后对我说，‘你眼泪都流出来啦。我清楚地看到，一切都很理想。可是我必须谨慎小心，因为我们曾两次被带假发的家伙、一次被染头发的家伙骗了。我可以告诉你一些有关鞋蜡的故事，你听了会感觉恶心的。'他走到窗户那里声嘶力竭地高喊，'已经有人填补空缺了。'窗户下面传来一阵大失所望的叹息声，人们成群结队地朝四面八方散开。他们走后，除我自己和那个干事外，再见不到一个红头发的人了。
“他说，‘我名叫邓肯·罗斯先生。我自己就是一个我们高贵的施主遗留基金的养老金领取者。威尔逊先生，你是不是已经结婚了？你成家了吗？'
“我回答说，‘我没有。'
“他立即把脸一沉。
“他严肃地说，‘哎唷！这可是非同小可的事啊！你所说的情况使我感到遗憾。当然罗，设立这笔基金的目的既是为了维护，也是为了生育更多红头发的人。你竟然是个未婚的单身汉，那真是太不幸了。'
“我听到这些话感到很沮丧。我当时想，完了，这个职位还是弄不到手。但是他考虑了一会以后又说：那没有关系。
“他说，‘如果是别人的话，这个缺点可能是不幸的。但是，你的头发长得这么好，对你这样一个人，我们必须破例照顾。你什么时候可以来上班？'
“我说，‘唔，事情有点不好办，因为我已有了一个起子。'
“文森特·斯波尔丁说，‘那不要紧，我能替你照管你的生意。'
“我问，‘上班时间是几点到几点？'
“'上午十点到下午两点。'
“我说，‘这对我很合适。薪金多少？'
“'每周四英镑。'
“'那工作怎么样？'
“'只是挂挂名而已。'
“'你说挂挂名是什么意思？'
“'唔，在整个办公时间你必须呆在办公室里，或者至少在那楼房里呆着；如果你离开，那你就是永远放弃了你的整个职位。对于这一点在遗嘱上说得很清楚。如果你在这段时间里稍微离开一下办公室，那就是没有按照条件办事。'
“我说，‘一共只有四个小时，我是怎么也不会离开一步的。'
“邓肯·罗斯先生说，‘不得以任何理由为借口，不管是有病、有事或其他理由都不行。你必须老老实实呆在那里，否则你就会丢掉你的位置。'
“'干什么工作呢？'
“'你的工作是抄写《大英百科全书》，这里有这个版本的第一卷。你要自备墨水、笔和吸墨纸。我们只提供给你这张桌子和这把椅子。你明天能来上班吗？'
“我回答说，‘当然可以。'
“'那么，杰贝兹·威尔逊先生，再见，让我再一次祝贺你这么幸运地得到这个重要职位。'他向我鞠了个躬。我随即离开了那个房间，和我伙计一起回家去。我为自己的好运气简直高兴得六神无主，不知所措了。
“唔，我整天都在思量这件事。到晚上，我的情绪又消沉下来了，因为我总觉得这件事一定是某种大片局或大诡计，虽然我猜想不出它的目的是什么。看来说有人立下这样的遗嘱，或者给那么多的钱让人做象抄写《大英百科全书》这种简单的工作，简直都是不可思议的。文森特·斯波尔丁想尽一切办法来宽慰我。到就寝时，我已使自己从这整个事件中得出结论，不管怎样，我决定第二天早晨去看看究竟是怎么回事。我花一个便士买了一瓶墨水、一根羽毛笔、七张大页书写纸，然后动身到教皇院去。
“唔，使我又惊又喜的是，一切都很顺利。桌子已给我摆好了，邓肯·罗斯先生在那里照料，好让我顺利地开始工作。他让我从字母Ａ开始抄，然后离开我，但他不时走进来看看我工作进行得是否顺当。下午两点钟他和我说再见，并称赞我抄写得真不少。我走出办公室后，他就把门锁上。
“事情就这样一天天地继续下去。到了星期六，那干事进来，付给我四个英镑的金币作为我一周工作的报酬。下星期是这样，再下星期还是这样。我每天上午十点到那里上班，下午两点下班。以后邓肯·罗斯先生就逐渐地不怎么常来了，有时候一个上午只来一次，再过一段时间，他就根本不来了。当然，我还是一会儿也不敢离开办公室，因为我不敢肯定他什么时候可能会来的，而这个职务确实很不错，对我很合适，我不愿冒丢掉它的风险。
“就这样，八个星期的时间过去了。我抄写了'男修道院院长'、‘盔甲'、‘建筑学'和'雅典人'等词条；并且希望由于我的勤奋努力，不久就可以开始抄写以字母Ｂ为首的词条。我花了不少钱买大页书写纸，我抄写的东西几乎堆满了一个架子。接着，这整个事情突然宣告结束。”
“结束？”
“是的，先生。就是今天上午结束的。我照常十点钟去上班，但是门关着而且上了锁，在门的嵌板中间用品头钉钉着一张方形小卡片。这张卡片就在这儿，你们自己可以看看。”
他举着一张约有便条纸大小的白色卡片，上面这样写着：
红发会业经解散，此启。一八九○年十月九日
我感到很震惊，我不知道怎么办才好。我向办公室周围的街坊打听，但是，看来他们谁也不知道那是怎么回事。最后，我去找房东，他住在楼下，是当会计的。我问他能否告诉我红发会出了什么事。他说，他从来没有听说过有这样一个团体。然后，我问他邓肯·罗斯先生是什么人。他回答说，这个名字对他很陌生。
“我说，‘唔，是住在７号的那位先生。'
“'什么，那个红头发的人？'
“'是的。'
“他说，‘噢，他名叫威廉·莫里斯。他是个律师，他暂住我的屋子，因为他的新居还没有准备好。他是昨天搬走的。'
“'我在什么地方能找到他呢？'
“'噢，在他的新办公室。他确实把他的地址告诉我了。是的，爱德华王街１７号，就在圣保罗教堂附近。'
我马上动身到那里去了，但是，当我找到那个地方的时候，我发现它是个护膝制造厂，这个厂子里谁也没有听说过有个叫威廉·莫里斯或叫邓肯·罗斯的人。”
“我回到我在萨克斯—科伯格广场的家去。我接受了我伙计的劝告。可是，他的劝告根本帮不了我的忙。他只是说，如果我耐心等待，也许能收到来信，从中得到消息。
我希望你能帮帮我，弄明白这一切究竟是怎么回事，我觉得我可能受到了愚弄。
"""

about_staff = """
# 关于伙计的信息
威尔逊雇佣的伙计是文森特·斯波尔丁。其实他的年纪也不小了，只是到底多大我说不上。我这个伙计真精明强干。我很清楚，他本来可以生活得更好些，赚比我付给他多一倍的工资。可是，不管怎么讲，他很满意。
他也有他的毛病。他比谁都爱照相。他拿着照相机到处照，就是没有上进心。他一照完相就急急忙忙地跑到地下室去冲洗，快得象兔子钻洞一样。这是他最大的毛病，但是，总的说来，他是个好工人，他没有坏心眼。
伙计在在发生这件事以前大约一个月来到我这里，他是看广告应征而来的。
当时共10个人申请，但是他灵巧，只领一半工资。
他小个子，体格健壮，动作很敏捷；虽然年龄约在三十开外，脸皮却很光滑。他的前额有一块被硫酸烧伤的白色伤疤。
他的两只耳朵穿了戴耳环的孔，他对我说，是他年轻的时候一个吉起赛人给他在耳朵上穿的孔。”
我不在店铺的时候生意一直由他照料，我对他的工作没有什么可抱怨的。
"""

about_self = """
# 关于我的信息
我是威尔逊，
我开了一家小店，雇佣了文森特·斯波尔丁，还有一个十四岁的小女孩。这个女孩子做饭、打扫房子。我屋子里就只这些人，因为我是个鳏夫，我没有成过家。我们三个人一起过着安静的生活；我们住在一起，欠了债一起还，要是没有别的事可做的话。
我是一个普普通通的英国商人，肥肥胖胖，样子浮夸，动作迟钝。我穿着一条松垂的灰格裤子，一件不太干净的燕尾服，前面的扣子没有扣上，里面穿着一件土褐色背心，背心上面系有一条艾尔伯特式的粗铜链，还有一小块中间有一个四方窟窿的金属片儿作为装饰品，来回晃动着。我有一顶磨损了的礼帽和一件褪了色的棕色大衣，大衣的线绒领子已经有点皱褶。我面露非常恼怒和不满的表情。
干过一段时间的体力活，吸鼻烟，是个共济会会员，到过中国，最近写过不少东西。
右手比左手大多了。用右手干活，右手的肌肉比左手发达。
带了一个弓形指南针模样的别针
右手袖子上足有五寸长的地方闪闪发光，而左袖子靠近手腕经常贴在桌面上的地方打了个整洁的补丁。
你的右手腕上边一点的地方文刺的鱼只能是在中国干的。
表链上还挂着一块中国钱币
"""

road1_text = """
通往威尔逊店铺的小路，湫隘狭窄破落而又虚摆场面的穷街陋巷，四排灰暗的两层砖房排列在一个周围有铁栏杆的围墙之内。院子里是一片杂草丛生的草坪，草坪上几簇枯萎的月桂小树丛正在烟雾弥漫和很不适意的环境里顽强地生长着。越是靠近纳尔逊的小店，地面的回响越大。
"""

road2_text = """
从纳尔逊店铺绕到城市另外一面的小路，是市区通向西北的一条交通大动脉。街道被一股熙熙攘攘做生意的人的洪流堵塞住了；在这洪流中，有向内流的，也有向外流的。人行道则被蜂拥而来的无数行人踩得发黑。
"""

objects = {
    "家": {
        "主体": "你的家，你可以获取你需要获取的一切信息，和`椅子`对话，提交你的结论。",
        "任务信封": mission_text,
        "威尔逊": about_staff+about_self,
        "椅子": "我是一把椅子，向我说出你的推理结果",
    },
    "城门": {"主体": "一个标志性的大门，大门后面有两条道路，一条通往城市的背面，一条是正面"},
    "通往威尔逊店铺的小路": {"主体": road1_text},
    "威尔逊的店": {
        "主体": "上方有一块棕色木板和三个镀金的圆球，上面刻有 杰贝兹·威尔逊 这几个白色大字，这是委托人做买卖的所在地。",
        "文森特": "看上去很精明能干、胡子刮得光光，非常不满有人打扰，裤子膝部那个地方破旧、皱褶和肮脏。"
    },
    "从威尔逊店铺绕到城市另一面的小路": {"主体": road2_text},
    "烟草店": {"主体": "生意很好的烟草店，经常有人在这里买烟，在城市的最繁华的路口"},
    "报刊亭": {
        "主体": "一个报刊亭，紧挨着烟草店",
        "报纸": "通缉：约翰·克莱，杀人犯、盗窃犯、抢劫犯、诈骗犯，年纪轻轻，祖父是王室公爵，在伊顿公学和牛津大学读过书。"
                "他神出鬼没一个星期在苏格兰砸烂一个儿童床，而下一下星期却在康沃尔筹款兴建一个孤儿院。"
    },
    "银行": {"主体": "仅挨着酒馆，似乎背面就是威尔逊的小店，但在银行大楼的遮蔽下，没人会想到后面是一个破落的小店。"},
    "酒馆": {
        "主体": "喝酒有害健康！",
        "醉汉": "银行职工，跟他多说两句，他就会说出几个月以前，银行向法兰西银行借了三万个法国金币。这些钱仍然放在地下室里。黄金储备现在比一家分所平常所拥有的数量大得多"
    },
    "马车工厂": {"主体": "我们工人有力量！"},
    "詹姆士礼堂": {"主体": "享受音乐吧！"},
}